# Rebar Crank Overridable Parameters Properties

Source: https://www.revitapidocs.com/2026/8548fdda-5707-79c3-1ca1-c9f541f4b6ba.htm

---

| Rebar Crank Overridable Parameters Properties |
| --- |

The RebarCrankOverridableParameters type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace